app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales` WHERE (`sales`.`sale_date` BETWEEN '2014-09-08' AND '2014-09-08') AND (invoice like 'CB%')
---
  def sale_report
	@from = Date.strptime(params[:from])
	@to = Date.strptime(params[:to])
    @sales = Sale.where(:sale_date  => @from..@to)

SELECT `sale_products`.* FROM `sale_products` WHERE `sale_products`.`sale_id` IN (590, 591, 592, 593)
---
	def sale_report
		@opening_stock = Hash.new
		@sale_stock = Hash.new

		@total_stock_price = 0
	#	@products = Product.includes({sale_products: :sale})
		@products = Product.all

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1047, 1274, 2589, 2424, 3535, 1010)
SELECT SUM(`sale_products`.`price`) AS sum_id FROM `sale_products` WHERE `sale_products`.`sale_id` = 590
SELECT SUM(`sale_returns`.`price`) AS sum_id FROM `sale_returns` WHERE `sale_returns`.`sale_id` = 590
---
	def sale_report

		@total_sale = 0
		@total_cb_sale = 0
		@total_cd_sale = 0

		@from = Date.strptime(params[:from])
	  @to = Date.strptime(params[:to])
    @sales = Sale.includes({sale_products: :product}).where(:sale_date  => @from..@to)
		unless params[:report_type] == "ALL"
			@sales = @sales.where("invoice like ?", "#{params[:report_type][0..1]}%")
		else
			@cb_sales = @sales.where("invoice like ?", "CB%")
			@cb_sales.each do |sale|
				total_sales = sale.sale_products.sum(:price)
				discount = (total_sales * (sale.discount).to_f / 100)
				@total_cb_sale += (total_sales - sale.sale_returns.sum(:price) - discount)

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (955, 1003, 1274, 1356, 1279, 1383, 532, 209, 2339, 1043, 1006, 358, 2337, 1093, 3378, 3161, 1004, 3380, 587, 2427, 2895, 964, 972, 1059, 1069, 840, 3354, 657, 2643, 3403, 2602, 3381, 988)
SELECT `sales`.* FROM `sales` WHERE `sales`.`sale_date` = '2014-09-01' AND (`sales`.`sale_date` BETWEEN '2014-09-01' AND '2014-09-15')
SELECT `sales`.* FROM `sales` WHERE `sales`.`sale_date` = '2014-09-01' AND `sales`.`sale_type` = 'CBP' AND (`sales`.`sale_date` BETWEEN '2014-09-01' AND '2014-09-15')
SELECT SUM(`sale_products`.`price`) AS sum_id FROM `sale_products` WHERE `sale_products`.`sale_id` = 346
---
	def sales_register
    if (params[:from].present? && params[:to].present?)

			@from = Date.strptime(params[:from])
			@to = Date.strptime(params[:to])
			@sales = Sale.includes({sale_products: :product}).where(:sale_date  => @from..@to)
			@cb_sale = Hash.new
			@cd_sale = Hash.new
			@total_cb_sale = 0
			@total_cd_sale = 0
			@total_sale = Hash.new
			@total_return = 0
			@return_on_date = Hash.new
			for mydate in @from..@to
				cb_sales = @sales.where(:sale_date  => mydate, :sale_type => 'CBP')
				total_sale = 0
				cb_sales.each do |sale|
					ts = sale.sale_products.sum(:price)

SELECT SUM(`sale_returns`.`price`) AS sum_id FROM `sale_returns` WHERE `sale_returns`.`sale_id` = 346
---
				sales = @sales.where(:sale_date  => mydate)
				total_return = 0
				sales.each do |sale|
					sr = sale.sale_returns.sum(:price)