app/views/sales/_sale_report.html.erb

SELECT SUM(`sale_products`.`price`) AS sum_id FROM `sale_products` WHERE `sale_products`.`sale_id` = 590
SELECT `sale_products`.* FROM `sale_products` WHERE `sale_products`.`sale_id` IN (590, 591, 592, 593)
---
	<%
		total_sales = sale.sale_products.sum(:price)

SELECT SUM(`sale_returns`.`price`) AS sum_id FROM `sale_returns` WHERE `sale_returns`.`sale_id` = 590
---
	%>
	<% @total_sale += (sale.sale_products.sum(:price) - sale.sale_returns.sum(:price) - discount)  %>